Revit 2026 API

# INavisworksExporter Interface

---

The interface used to implement a Navisworks exporter.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public interface INavisworksExporter : IExternalServer
```
```vb
Public Interface INavisworksExporter
	Inherits IExternalServer
```
```cpp
public interface class INavisworksExporter : IExternalServer
```
```fsharp
type INavisworksExporter =
    interface
        interface IExternalServer
    end
```

The INavisworksExporter type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Export | The method that Revit will invoke to perform an export to Navisworks. |
|  | GetDescription | Implement this method to return a description of the server. (Inherited from IExternalServer) |
|  | GetName | Implement this method to return the name of the server. (Inherited from IExternalServer) |
|  | GetServerId | Implement this method to return the id of the server. (Inherited from IExternalServer) |
|  | GetServiceId | Implement this method to return the id of the service. (Inherited from IExternalServer) |
|  | GetVendorId | Implement this method to return the id of the vendor of the server. (Inherited from IExternalServer) |
|  | ValidateExportOptions | Determines if the inputs are valid, and returns an error message if not. |

Implement this interface and register an instance of the derived class with the Navisworks external service.

#### Reference

Autodesk.Revit.DB Namespace